#Дана строка. Подсчитать самую длинную последовательность подряд идущих букв «н». Преобразовать ее, заменив точками все восклицательные знаки.
f = (input("Введите строку \n"))
n = 0
y = []
max_n = 0
for i in range(len(f) - 1):
    if f[i] == f[i+1] == 'н':
        n += 1
        max_n = max(n,max_n)
    else:
        n = 1
print(max_n)
print(f.replace("!", "."))
#Дана строка символов, среди которых есть одна открывающаяся и одна закрывающаяся скобки. Вывести на экран все символы, расположенные внутри этих скобок.
g = (input("Введите строку \n"))
print(g[g.find('(')+1 : g.find(')')])
#   
h = (input("Введите строку \n"))
j = (h.split())
for i in j:
    if i.startswith('а') and i.endswith('я'):
        print(i, end=' ')
        
